app/views/people/index.html.erb

    <td><%= person.dev_serial %></td>
    <td><%= person.events.count %></td>
---
SELECT COUNT(*) FROM "events" WHERE "events"."person_id" = 3732