app/views/people/index.html.erb

<% if admin && @organization_id %>
  <p><%= link_to "Send Email with All #{Organization.where(:id => @organization_id).first.name}'s Data as CSV", {:controller => "people", :action => "export_to_csv", organization_id: @organization_id}, class: "btn btn-info"  %></p>
---
SELECT "people".* FROM "people" WHERE "people"."id" IS NULL LIMIT 1