app/views/pages/dashboard.html.erb

SELECT DISTINCT(ACTION) FROM "events"
SELECT COUNT(*) FROM "events" WHERE "events"."action" = 'dashboard'
---
<ul>
<% Event.select("DISTINCT(ACTION)").each do |e| %>
  <li><%= e.action %> - <%= Event.where(action: e.action).count %></li>