app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'pirate@example.com' LIMIT 1
---
  def create
    u = User.find_by_email(params[:email])